{
  "subject": "history",
  "topic": "jalianwala baug",
  "wikipedia": {
    "title": "Rowlatt Act",
    "summary": "The Anarchical and Revolutionary Crimes Act of 1919, popularly known as the Rowlatt Act, was a law, applied during the British India period. It was a legislative council act hurriedly passed by the Imperial Legislative Council in Delhi on 18 March 1919, despite the united opposition of its Indian members, indefinitely extending the emergency measures of preventive indefinite detention, imprisonment without trial and judicial review enacted in the Defence of India Act 1915 during the First World War. It was enacted in the light of a perceived threat from revolutionary nationalists of re-engaging in similar conspiracies as had occurred during the war which the Government felt the lapse of the Defence of India Act would enable.",
    "content": "The Anarchical and Revolutionary Crimes Act of 1919, popularly known as the Rowlatt Act, was a law, applied during the British India period. It was a legislative council act hurriedly passed by the Imperial Legislative Council in Delhi on 18 March 1919, despite the united opposition of its Indian members, indefinitely extending the emergency measures of preventive indefinite detention, imprisonment without trial and judicial review enacted in the Defence of India Act 1915 during the First World War. It was enacted in the light of a perceived threat from revolutionary nationalists of re-engaging in similar conspiracies as had occurred during the war which the Government felt the lapse of the Defence of India Act would enable.\n\n\n== Purpose and introduction ==\nThe British Colonial Government passed the \"Rowlatt Act\", which gave power to the police to arrest any Indian person on the basis of mere suspicion. The purpose of the Act was to curb the growing nationalist upsurge in the country. Mahatma Gandhi called upon the people to perform Satyagraha against this act.\nPassed on the recommendations of the Rowlatt Committee and named after its president, Sir Sidney Rowlatt, the act effectively authorized the colonial British government to imprison any person suspected of terrorism living in British India for up to two years without trial, and gave the colonial authorities power to deal with all revolutionary activities.\nThe unpopular legislation provided for stricter control of the press, arrests without warrant, indefinite detention without trial, and juryless in camera trials for proscribed political acts. The accused were denied the right to know the accusers and the evidence used in the trial. A special panel, made up of three high court judges, was designated to hear cases involving such suspects. This panel served as the final authority, with no higher court available for appeal. The law of habeas corpus was suspended. Furthermore, it possessed the power to admit evidence that would not be permissible under the standard rules of the Indian Evidence Act. Those convicted were required to deposit securities upon release, and were prohibited from taking part in any political, educational, or religious activities.\nOn the report of the committee, headed by Justice Rowlatt, two bills were introduced in the Central Legislature on 6 February 1919. These bills came to be known as \"Black Bills\". Despite much opposition, the Rowlatt Act was passed on 18 March 1919. Under the Rowlatt act 1919, the chief justice was empowered to decide on the immediate custody of the accused between the trial and release on bail for smooth implementation of the act. The act also provides a penalty for disobedience of any order promulgated\n\n\n== Effect ==\nMahatma Gandhi, among other Indian leaders, was extremely critical of the Act and argued that not everyone should be punished in response to isolated political crimes. Madan Mohan Malaviya, Mazarul Haque and Muhammad Ali Jinnah, a member of the All-India Muslim League resigned from the Imperial legislative council in protest against the act. The act also infuriated many other Indian leaders and the public, which caused the government to implement repressive measures.Gandhi and others thought that constitutional opposition to the measure was fruitless, so on 6 April, a hartal took place. This was an event in which Indians suspended businesses and went on strikes and would fast, pray and hold public meetings against the 'Black Act' as a sign of their opposition and civil disobedience would be offered against the law. Mahatma Gandhi bathed in the sea at Mumbai and made a speech before a procession to Madhav Baug temple took place. This event was part of the Non-cooperation movement. One of the largest protests occurred in Ambala, Punjab Province in early 1919 under the chairmanship of the lawyer Jhanda Singh Giani. \nIt was the Rowlatt Act which brought Gandhi to the mainstream of the Indian struggle for independence and ushered in the Gandhian Era of Indian politics. Jawaharlal Nehru described Gandhi's entry into the protests in his Glimpses of World History:\n\nEarly in 1919 he was very ill. He had barely recovered from it when the Rowlatt Bill agitation filled the country. He also joined his voice to the universal outcry. But this voice was somehow different from others. It was quiet and low, and yet it could be heard above the shouting of the multitude; it was soft and gentle , and yet there seemed to be steel hidden away somewhere in it; it was courteous and full of appeal, and yet there was something grim and frightening in it; every word used was full of meaning and seemed to carry a deadly earnestness. Behind the language of peace and friendship there was power and quivering shadow of action and a determination not to submit to a wrong...This was something very different from our daily politics of condemnation and nothing else, long speeches always ending in the same futile and ineffective resolutions of protest which nobody took very seriously. This was the politics of action, not of talk.\n\nHowever, the success of the hartal in Delhi, on 30 March, was overshadowed by tensions running high, which resulted in rioting in the Punjab, Delhi and Gujarat. Deciding that Indians were not ready to make a stand consistent with the principle of nonviolence, an integral part of satyagraha (disobeying the British colonial government's laws without using violence), Gandhi suspended the resistance.\nThe Rowlatt Act came into effect on 21 March 1919. In Punjab the protest movement was very strong, and on 10 April two leaders of the congress, Dr. Satyapal and Saifuddin Kitchlew, were arrested and taken secretly to Dharamsala. On 13 April people from neighbouring villages gathered for Baisakhi Day celebrations and to protest against their deportation in Amritsar. Subsequently, the army was called into Punjab, which resulted in the Jallianwala Bagh massacre of 1919.\n\n\n== Revocation ==\nAccepting the report of the Repressive Laws Committee, the British colonial government repealed the Rowlatt Act, the Press Act, Regulation III of 1818, the Passport Act, the Sedition laws (Section 124A of the IPC), the Official Secrets Act, the Criminal Law Amendment Acts of 1908 and 1913, the Explosive Substances Act, the Seditious Meetings Act, the Indian Arms Act, the Prevention of Seditious Meetings Act, the Police Act of 1861, the Public Safety Act, the Defence of India Act (1915) , the Cantonments Act, the Indian Newspapers (Incitement to Offences) Act, the Indian Criminal Law Amendment Ordinance, the Indian States Protection Act, the Press Emergency Powers Act, the Emergency Powers Ordinance, the Indian Political Service Regulations, the Criminal Tribes Act, and the Section 144 of the Criminal Procedure Code (CrPC) in March 1922.\n\n\n== See also ==\n\nChamparan Satyagraha and Kheda Satyagraha\nNon-cooperation movement\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nCommittee, Sedition (1918), Sedition Committee Report, 1918, Home Department, Government of India.\nRowlatt act, GetLegal India",
    "url": "https://en.wikipedia.org/wiki/Rowlatt_Act",
    "related_articles": []
  },
  "timestamp": 1754298662.7397027
}