{
  "subject": "history",
  "topic": "wha",
  "wikipedia": {
    "title": "WHA",
    "summary": "An interrogative word or question word is a function word used to ask a question, such as what, which, when, where, who, whom, whose, why, whether and how.  They are sometimes called wh-words, because in English most of them start with wh- (compare Five Ws). Most may be used in both direct (Where is he going?) and in indirect questions (I wonder where he is going). In English and various other languages the same forms are also used as relative pronouns in certain relative clauses (The country where he was born) and certain adverb clauses (I go where he goes). It can also be used as a modal, since question words are more likely to appear in modal sentences, like (Why was he walking?)\nA particular type of interrogative word is the interrogative particle, which serves to convert a statement into a yes–no question, without having any other meaning. Examples include est-ce que in French, ли li in Russian, czy in Polish, чи chy in Ukrainian, ĉu in Esperanto, āyā آیا in Persian, কি ki in Bengali, 嗎/吗 ma in Mandarin Chinese, mı/mi/mu/mü in Turkish, pa in Ladin, か ka in Japanese, 까 kka in Korean, ko/kö in Finnish, tat in Catalan, (да) ли (da) li in Serbo-Croatian and al and ote in Basque. \"Is it true that...\" and \"... right?\" would be a similar construct in English. Such particles contrast with other interrogative words, which form what are called wh-questions rather than yes–no questions.\nFor more information about the grammatical rules for using formed questions in various languages, see Interrogative.",
    "content": "An interrogative word or question word is a function word used to ask a question, such as what, which, when, where, who, whom, whose, why, whether and how.  They are sometimes called wh-words, because in English most of them start with wh- (compare Five Ws). Most may be used in both direct (Where is he going?) and in indirect questions (I wonder where he is going). In English and various other languages the same forms are also used as relative pronouns in certain relative clauses (The country where he was born) and certain adverb clauses (I go where he goes). It can also be used as a modal, since question words are more likely to appear in modal sentences, like (Why was he walking?)\nA particular type of interrogative word is the interrogative particle, which serves to convert a statement into a yes–no question, without having any other meaning. Examples include est-ce que in French, ли li in Russian, czy in Polish, чи chy in Ukrainian, ĉu in Esperanto, āyā آیا in Persian, কি ki in Bengali, 嗎/吗 ma in Mandarin Chinese, mı/mi/mu/mü in Turkish, pa in Ladin, か ka in Japanese, 까 kka in Korean, ko/kö in Finnish, tat in Catalan, (да) ли (da) li in Serbo-Croatian and al and ote in Basque. \"Is it true that...\" and \"... right?\" would be a similar construct in English. Such particles contrast with other interrogative words, which form what are called wh-questions rather than yes–no questions.\nFor more information about the grammatical rules for using formed questions in various languages, see Interrogative.\n\n\n== In English ==\n\nInterrogative words in English can serve as interrogative determiners, interrogative pronouns, or interrogative adverbs. Certain pronominal adverbs may also be used as interrogative words, such as whereby or wherefore.\n\n\n=== Interrogative determiner ===\nThe interrogative words which, what and whose are interrogative determiners when specifying a noun or nominal phrase: The question Which farm is the county’s largest? specifies the noun farm as definite, while What farm? is indefinite. In the question Whose gorgeous, pink painting is that?, whose is the interrogative, personal, possessive determiner prompting a specification for the possessor of the noun phrase gorgeous pink painting.\n\n\n=== Interrogative pronoun ===\nThe interrogative words who, whom, whose, what and which are interrogative pronouns when used in the place of a noun or noun phrase. In the question Who is the leader?, the interrogative word who is a interrogative pronoun because it stands in the place of the noun or noun phrase the question prompts (e.g. the king or the woman with the crown). Similarly, in the question Which leads to the city center? the interrogative word which is an interrogative pronoun because it stands in the place of a noun or noun phrase (e.g. the road to the north or the river to your east). Note, which is an interrogative pronoun, not an interrogative determiner, because there is no noun or noun phrase present to serve as a determiner for. Consequently, in the question Which leads to the city center? the word which is an interrogative pronoun; when in the question Which road leads to the city center? the word which is an interrogative determiner for the noun road.\n\n\n=== Interrogative adverb ===\nThe interrogative words where, when, how, why, whether, whatsoever, and the more archaic whither and whence are interrogative adverbs when they modify a verb. In the question How did you announce the deal? the interrogative word how is an interrogative adverb because it modifies the verb did (past tense of to do). In the question Why should I read that book? the interrogative word why is an interrogative adverb because it describes the verb should.\nNote, in direct questions, interrogative adverbs always describe auxiliary verbs such as did, do, should, will, must, or might.\n\n\n=== Yes–no questions ===\nA yes–no question can begin with an interrogative subject-verb inversion involving an auxiliary verb (or negative contraction), sometimes even if it is not performing the auxiliary function:\n\nA finite inflection of be (e.g. Are you hungry?, Are you working from home today?)\nA finite inflection of have (e.g. Have you any soup? Hasn’t she eaten lunch?)\nA conjugation of do (e.g. Do you want fries?) - see Do-support § In questions\nA conjugation of a modal verb (e.g. Can't you move any faster?)\nEnglish questions can also be formed without an interrogative word as the first word, by changing the intonation or punctuation of a statement. For example: \"You're done eating?\"\n\n\n=== Forms with -ever ===\nMost English interrogative words can take the suffix -ever, to form words such as whatever and wherever. (Older forms of the suffix are -so and -soever, as in whoso and whomsoever.) These words have the following main meanings:\n\nAs more emphatic interrogative words, often expressing disbelief or puzzlement in mainly rhetorical questions: Whoever could have done such a thing? Wherever has he gone?\nTo form free relative clauses, as in I'll do whatever you do, Whoever challenges us shall be punished, Go to wherever they go. In this use, the nominal -ever words (who(m)ever, whatever, whichever) can be regarded as indefinite pronouns or as relative pronouns.\nTo form adverbial clauses with the meaning \"no matter where/who/etc.\": Wherever they hide, I will find them.\nSome of these words have also developed independent meanings, such as however as an adverb meaning \"nonetheless\"; whatsoever as an emphatic adverb used with no, none, any, nothing, etc. (I did nothing wrong whatsoever); and whatever in its slang usage.\n\n\n== Other languages ==\nA frequent class of interrogative words in several other languages is the interrogative verb:\n\nKorean:\n\nMongolian:\n\n\n=== Australian Aboriginal languages ===\nInterrogative pronouns in Australian Aboriginal languages are a diverse set of lexical items with functions extending far beyond simply the formation of questions (though this is one of their uses). These pronominal stems are sometimes called ignoratives or epistememes because their broader function is to convey differing degrees of perceptual or epistemic certainty. Often, a singular ignorative stem may serve a variety of interrogative functions that would be expressed by different lexical items in, say, English through contextual variation and interaction with other morphology such as case-marking. In Jingulu, for example, the single stem nyamba may come to mean 'what', 'where', 'why' or 'how' through combination with locative, dative, ablative, and instrumental case suffixes:\n\n(Adapted from Pensalfini)\nOther closely related languages, however, have less interrelated ways of forming wh-questions with separate lexemes for each of these wh-pronouns. This includes Wardaman, which has a collection of entirely unrelated interrogative stems: yinggiya 'who', ngamanda 'what', guda 'where', nyangurlang 'when', gun.garr-ma 'how many/what kind'.\nMushin (1995) and Verstraete (2018) provide detailed overviews of the broader functions of ignoratives in an array of languages. The latter focuses on the lexeme ngaani in many Paman Languages which can have a Wh-like interrogative function but can also have a sense of epistemic indefiniteness or uncertainty like 'some' or 'perhaps;' see the following examples from Umpithamu:\nWh-question\n\nAdnominal / Determiner\n\nAdverbial\n\n(Verstraete 2018)\n\n\n== See also ==\nFive Ws\nIndeterminate pronoun\nSentence function\n\n\n== References ==",
    "url": "https://en.wikipedia.org/wiki/Interrogative_word",
    "related_articles": [
      "World History Association",
      "Western History Association",
      "WHA (AM)",
      "1979 NHL expansion"
    ]
  },
  "timestamp": 1754391953.4944065
}