{
  "subject": "history",
  "topic": "who was Akbar in history",
  "wikipedia": {
    "title": "Akbar",
    "summary": "A sobriquet ( SOH-brih-kay, -⁠KAY) is a descriptive nickname, sometimes assumed, but often given by another. A sobriquet is distinct from a pseudonym in that it is typically a familiar name used in place of a real name without the need for explanation; it may become more familiar than the original name.\nAn example is Mohandas Gandhi, who is better known as Mahatma Gandhi (\"mahatma\" means \"great soul\" in Sanskrit). \nThe term sobriquet is equally applicable as a name for a person, group of people, historical event, or place. Well-known places often have sobriquets, such as New York City, often called the \"Big Apple\", or Rome, the \"Eternal City\", or Vienna, the \"Golden Apple\".",
    "content": "A sobriquet ( SOH-brih-kay, -⁠KAY) is a descriptive nickname, sometimes assumed, but often given by another. A sobriquet is distinct from a pseudonym in that it is typically a familiar name used in place of a real name without the need for explanation; it may become more familiar than the original name.\nAn example is Mohandas Gandhi, who is better known as Mahatma Gandhi (\"mahatma\" means \"great soul\" in Sanskrit). \nThe term sobriquet is equally applicable as a name for a person, group of people, historical event, or place. Well-known places often have sobriquets, such as New York City, often called the \"Big Apple\", or Rome, the \"Eternal City\", or Vienna, the \"Golden Apple\".\n\n\n== Etymology ==\nThe modern French and English spelling is sobriquet. Two earlier variants are soubriquet and sotbriquet. The first variant, \"soubriquet\", dates from the 15th century and is rarely used now, in English or French.\nThe early 14th-century soubzsbriquez meant a \"little blow under the chin\" in French, also described as a chuck under the chin; this was derived from soubs, mod. sous (Latin: sub), under.\n\n\n== Usage ==\nSobriquets are \"a form of identification that goes beyond a traditional name and offers insight into a person’s character, appearance, profession, or any other distinguishing feature\". They are used in politics, music, literature and for royalty, celebrities, and athletes.  \nCandidates for public office and political figures may be described with sobriquets, while living or posthumously. For example, president of the United States Abraham Lincoln was called \"Honest Abe\". An affectionate contemporary sobriquet for Ulysses S. Grant was the \"American Sphinx\" as a man of deeds rather than for verbal self-promotion.\nEarly uses of sobriquets in writing and literature include the Dead Sea Scrolls and in Tang and Song (Southern Sung) dynasty poetry. Contemporary usage is common in the English and French languages.\n\n\n== Examples ==\nThe King (of rock and roll) – Elvis Presley, famous vocalist and musician\nThe Lion City – Singapore, the city-state, also known as Little Red Dot, The Garden City \nThe Big Yin – Billy Connolly, Glaswegian comedian commonly referred to as \"The Big Yin\", meaning \"The Big One\" in Scots\nThe Big Smoke – London or Toronto\nThe Land of the Rising Sun – Japan\nColumbia – The United States or the Americas, poetic name\nDixie, Dixieland (from the Mason–Dixon line) – the eleven Southern states that seceded and fought against the U.S. in the American Civil War\nThe Fourth Estate – the press\nPearl of the Orient – the Philippines, referring to its location in the Southeast Asia (or the East, with \"Orient\" meaning \"East\")\nGraveyard of empires – Afghanistan\nGautam Buddha – Siddhartha Gautama, derived from the word 'Budh', which means 'enlightened'.\nUncle Sam – the U.S. in general or specifically its government, likely from the initials \"U.S.\"\nJohn Bull – the UK in general or specifically, its government (originally an attack against the Whigs, their foreign policy, and their financiers who were profiting from wars with other nations).\nUncle Joe – Joseph Stalin\nThe Sun King – Louis XIV of France\nPapa Doc – François Duvalier, 34th president of Haiti\nThe Sage of Chelsea – Thomas Carlyle, Scots philosopher\nThe War to End All Wars – World War I; used ironically since World War II\nThe Windy City – Chicago, Illinois, US\nMotor City – Detroit, Michigan, US\nThe Mile High City – Denver, Colorado, US\nThe Big Apple – New York, New York, US\nThe Little Apple – Manhattan, Kansas, US\nThe Mini Apple – Minneapolis, Minnesota, US\nMan's best friend – dogs, derived from the origins of dogs, it indicates the relationship that has developed between the two species as they have each evolved to form a symbiotic relationship that is unique among human relationships to domestic animals.\nScotty from marketing – Scott Morrison, referring to his former marketing career\n\"Emiye Menelik\", a name of Emperor Menelik II of Ethiopia, who was popularly and affectionately recognized for his kindness (\"emiye\" means \"mother\" in Amharic)\n\n\n== See also ==\nElegant variation\nMoniker\nEpithet\n\n\n== References ==\n\n\n== Sources ==\n\n\n== External links ==\n The dictionary definition of sobriquet at Wiktionary",
    "url": "https://en.wikipedia.org/wiki/Sobriquet",
    "related_articles": [
      "History of coffee",
      "Jodhaa Akbar",
      "Akbar II",
      "History of Malaysia"
    ]
  },
  "timestamp": 1754379076.2520282
}