{
  "subject": "History",
  "topic": "mahatma gandhi",
  "wikipedia": {
    "title": "Family of Mahatma Gandhi",
    "summary": "The Gandhi family is the family of Mohandas Karamchand Gandhi (2 October 1869 – 30 January 1948), commonly known as Mahatma Gandhi; Mahatma meaning \"high souled\" or \"venerable\" in Sanskrit;  the particular term 'Mahatma' was accorded Mohandas Gandhi for the first time while he was still in South Africa, and not commonly heard as titular for any other civil figure even of similarly rarefied stature or living or posthumous presence.\nMohandas Gandhi was the leader of the Indian independence movement in British-ruled India. Mohandas Gandhi has been called contemporary, post-colonial sovereign India's Father of the Nation, a title first given to him by Subhas Chandra Bose on 6 July 1944 during Bose's address on the Singapore Radio. On 28 April 1947, Sarojini Naidu too referred to Gandhi with the title Father of the Nation. Mohandas Gandhi is also referred to as Bapu (Gujarati: endearment for \"father\") in India, as prime minister Nehru called him at his funeral. In common parlance in India he is often called Gandhiji; 'ji' being a honorific suffix. Gandhi has also been referred to (mostly by British officials) as Gae-ndy or Ga-ndhi as in Hindi the a makes an \"ah\" sound.\nIn 1883, Mahatma Gandhi married Kasturba (née Kasturbai Makhanji Kapadia). They had their first baby in 1885, who survived only a few days. The Gandhi couple had four more children, all sons: Harilal, born in 1888; Manilal, born in 1892; Ramdas, born in 1897; and Devdas, born in 1900. Mohandas and Kasturba being third generation members of the cogent strata of this clan in a modern continuous descent, following upon a notable first generation progenitor who was first in the family to hold the office of full Diwan, Prime Minister as the Mahatma translates it, in a princely state, their issue now has notable and active members in their family's seventh generation and continue to be steadily prolific. The Mahatma writes that \"The Gandhis belong to the Bania caste and seem to have been originally grocers.\"\nPrior to the Mahatma's grandfather being a Prime Minister in two different monarchial states, after a principled falling out with a royal faction in his first state, several generations of the Gandhi men had been Deputy Prime Ministers, if their career status is considered sufficiently notable in this family of political officials, then numeration of their generations as a 'dynasty' of ministers would be several numbers higher. Five generations before the Mahatma's grandfather, Lalji Gandhi (born circa 1674) was the first of 5 successful generations of Naib Diwans of the Princely state of Porbander.\n\nThe Nehru-Gandhi family, India's other significant family with surname Gandhi, is unrelated by biology and marriage to the family of Mahatma Gandhi, however the same spelling of 'Gandhi' came into the Nehru-Gandhi family when Jawaharlal Nehru's daughter Indira married politician Feroze Gandhi who had changed the spelling of his surname Ghandy to Gandhi precisely to match that of Mahatma Mohandas Karamchand Gandhi, revered as the 'father of the Indian nation'.\n\n",
    "content": "The Gandhi family is the family of Mohandas Karamchand Gandhi (2 October 1869 – 30 January 1948), commonly known as Mahatma Gandhi; Mahatma meaning \"high souled\" or \"venerable\" in Sanskrit;  the particular term 'Mahatma' was accorded Mohandas Gandhi for the first time while he was still in South Africa, and not commonly heard as titular for any other civil figure even of similarly rarefied stature or living or posthumous presence.\nMohandas Gandhi was the leader of the Indian independence movement in British-ruled India. Mohandas Gandhi has been called contemporary, post-colonial sovereign India's Father of the Nation, a title first given to him by Subhas Chandra Bose on 6 July 1944 during Bose's address on the Singapore Radio. On 28 April 1947, Sarojini Naidu too referred to Gandhi with the title Father of the Nation. Mohandas Gandhi is also referred to as Bapu (Gujarati: endearment for \"father\") in India, as prime minister Nehru called him at his funeral. In common parlance in India he is often called Gandhiji; 'ji' being a honorific suffix. Gandhi has also been referred to (mostly by British officials) as Gae-ndy or Ga-ndhi as in Hindi the a makes an \"ah\" sound.\nIn 1883, Mahatma Gandhi married Kasturba (née Kasturbai Makhanji Kapadia). They had their first baby in 1885, who survived only a few days. The Gandhi couple had four more children, all sons: Harilal, born in 1888; Manilal, born in 1892; Ramdas, born in 1897; and Devdas, born in 1900. Mohandas and Kasturba being third generation members of the cogent strata of this clan in a modern continuous descent, following upon a notable first generation progenitor who was first in the family to hold the office of full Diwan, Prime Minister as the Mahatma translates it, in a princely state, their issue now has notable and active members in their family's seventh generation and continue to be steadily prolific. The Mahatma writes that \"The Gandhis belong to the Bania caste and seem to have been originally grocers.\"\nPrior to the Mahatma's grandfather being a Prime Minister in two different monarchial states, after a principled falling out with a royal faction in his first state, several generations of the Gandhi men had been Deputy Prime Ministers, if their career status is considered sufficiently notable in this family of political officials, then numeration of their generations as a 'dynasty' of ministers would be several numbers higher. Five generations before the Mahatma's grandfather, Lalji Gandhi (born circa 1674) was the first of 5 successful generations of Naib Diwans of the Princely state of Porbander.\n\nThe Nehru-Gandhi family, India's other significant family with surname Gandhi, is unrelated by biology and marriage to the family of Mahatma Gandhi, however the same spelling of 'Gandhi' came into the Nehru-Gandhi family when Jawaharlal Nehru's daughter Indira married politician Feroze Gandhi who had changed the spelling of his surname Ghandy to Gandhi precisely to match that of Mahatma Mohandas Karamchand Gandhi, revered as the 'father of the Indian nation'.\n\n\n== Etymology ==\nGandhi: \"perfume seller,\" from Gujarati gandh, \"sandalwood\"\nThe Gandhi surname came into the separate Nehru-Gandhi family from Feroze Gandhi, a politician of Gujarati Parsi ancestry, who, after joining the independence movement, changed the spelling of his surname from Ghandy to Gandhi, to match that of the family of Mahatma Gandhi despite not being related biologically nor by marriage nor formal adoption.\nIn the case of the Mahatma Gandhi, Mohandas Karamchand Gandhi: Mahatma, Sanskrit, \"high souled\" or \"venerable\" is the particular term accorded Mohandas Gandhi for the first time while he was still in South Africa, and not commonly heard as titular for any other civil figure even of similarly rarefied stature or living or posthumous presence. Mohandas Gandhi is also referred to as Bapu (Gujarati: endearment for \"father\") in India, as prime minister Nehru called him at his funeral. In common parlance in India he is often called Gandhiji; 'ji' being a honorific suffix. Gandhi has also been referred to (mostly by British officials) as Gae-ndy or Ga-ndhi as in Hindi the a makes an \"ah\" sound. Mohandas Gandhi has been called contemporary, post-colonial sovereign India's Father of the Nation, a title first given to him by Subhas Chandra Bose on 6 July 1944 during Bose's address on the Singapore Radio. On 28 April 1947, Sarojini Naidu too referred to Gandhi with the title Father of the Nation.\n\n\n== First generation ==\nUttamchand Gandhi, husband of Laxmiba Gandhi, father of Karamchand Uttamchand Gandhi, called 'Ota' by his grandson Mahatma Mohandas Karamchand Gandhi, first in this family to hold the office of full, not deputy Diwan of Porbandar then after a principled falling out with the Queen's faction in his first princely state, Diwan of Junagadh instead, a colorful, daring character who hid condemned politicians and even returned to Porbander when the Queen died, giving service anew, but declining the Prime Minister's title in favor of his son holding that office\nLaxmiba Gandhi, wife of Uttamchand Gandhi, mother of Karamchand Uttamchand Gandhi\n\n\n== Second generation ==\nKaramchand Uttamchand Gandhi (1822–1885), nickname Kaba, fifth of six sons of Uttamchand and Laxmiba Gandhi, with 4th wife Putlibai Gandhi (1844 — 12 June 1891) father of Laxmidas (male), Raliatbehn (female), Karsandas (male), and Mohandas Karamchand (male) Gandhi, Diwan of Porbandar, Member of the Rajasthanik Court, and Diwan of Rajkot\nTulsidas Gandhi, sixth of six sons of Uttamchand and Laxmiba Gandhi, Diwan of Porbandar following the term of his older brother Karamchand Uttamchand\n\n\n== Third generation ==\nMohandas Karamchand Gandhi (Mahatma Gandhi) (2 October 1869 — 30 January 1948), son of Karamchand Uttamchand Gandhi and 4th wife Putlibai Gandhi, youngest brother of Laxmidas (male), Raliatbehn (female), and Karsandas (male) Gandhi, married Kasturba Gandhi, father of Harilal, Manilal, Ramdas and Devdas Gandhi, Indian subcontinent autonomy and multiculturalism leader acclaimed as Father of the Nation of modern India and as Mahatma, Sanskrit, 'Great Soul', civil rights champion in South Africa, attorney with law degree formally through Inner Temple and informal auditing at University College, University of London, barrister called to the bar 1891 at age 22\nKasturba Gandhi (née Kasturbai Gokuldas (or Makhanji) Kapadia) (11 April 1869 – 22 February 1944), wife of Mahatma Mohandas Karamchand Gandhi through arranged marriage when she was 14 and he was 13, mother of Harilal, Manilal, Ramdas and Devdas Gandhi, National Safe Motherhood Day is observed on April 11 every year in India, coinciding with her birthday\n\n\n== Fourth generation ==\nMaganlal Gandhi (1883–1928)\nHarilal Gandhi (1888–1948)\nManilal Gandhi (1892–1956)\nRamdas Gandhi (1897–1969)\nSamaldas Gandhi (1897–1953)\nDevdas Gandhi (1900–1957)\n\n\n== Fifth generation ==\nKanu Gandhi (1917–1986), photographer, several scenes from Richard Attenborough's biopic Gandhi were shot on the basis of Kanu's photographs, his wife Abha was one of the companions with Mahatma Gandhi at Birla House Delhi, when Godse shot Mahatma Gandhi\nKanu Gandhi (scientist) (1928–2016), scientist, MS.Civil Engineering Massachusetts Institute of Technology 1963, worked for NASA and United States Department of Defense on aircraft design, his wife Shivalaxmi was a professor and researcher in Boston Biomedical Research Institute, no issue.\nArun Manilal Gandhi (1934–2023), father of Tushar Gandhi\nRajmohan Gandhi (1935–), brother of Gopalkrishna and Ramchandra Gandhi and Tara Gandhi Bhattacharjee (née Gandhi)\nRamchandra Gandhi (1937–2007), son of Devdas Gandhi (Mahatma Gandhi's youngest son) and Lakshmi (daughter of Rajaji), brother of Rajmohan Gandhi, Gopalkrishna Gandhi and Tara Gandhi Bhattacharjee, father of Leela Gandhi, PhD Philosophy, Oxford University, founded the philosophy department at the University of Hyderabad, taught at Visva-Bharati University, Panjab University, California Institute of Integral Studies in San Francisco, California, and Bangalore University\nEla Gandhi (1940–), daughter of Manilal Gandhi and Sushila Mashruwala, Member of Parliament in South Africa from 1994 to 2004, former Chancellor of Durban University of Technology, chairs the Mahatma Gandhi Salt March Committee and the Mahatma Gandhi Development Trust which she founded\nGopalkrishna Gandhi (1945–), son of Devdas and Lakshmi Gandhi, brother of Rajmohan, Ramchandra Gandhi and Tara Gandhi Bhattacharjee (née Gandhi), 22nd Governor of West Bengal serving from 2004 to 2009, served as Secretary to the President of India and as High Commissioner to South Africa and Sri Lanka, younger brother of Rajmohan Gandhi, Ramchandra Gandhi, and Smt. Tara Bhattacharjee (Gandhi), has 2 daughters with his wife Tara\nSumitra Kulkarni (née Gandhi) (1929–), daughter of Ramdas and Nirmala Gandhi, Member of Rajya Sabha (1972–1978), married Gajanan Raghunath Kulkarni, has twin sons Shriram and Shrikrishna and a daughter, Sonali\n\n\n== Sixth generation ==\nShanti Gandhi (1940–), son of Kantilal and Saraswati Gandhi, married Susan Gandhi, father of Ann, Anita and Anjali Gandhi, surgeon and US Republican party member of the Kansas House of Representatives, representing the 52nd District from 2013 to 2015.\nKirti Menon (1959–) (née Dhupelia), daughter of Sita (nee Gandhi) and Shashikant Dhupelia, married Sunil Menon, mother of Sunita Menon, Senior Director at the University of Johannesburg and chairman of the Gandhi Centenary Committee, South Africa, known for reforming the policy environment in post-secondary education sector in South Africa.\nTushar Arun Gandhi (1960–), son of Arun Manilal Gandhi and Sunanda Gandhi, married Sonal (née Desai) Gandhi, father of Vivan Gandhi (male) and Kasturi Gandhi (female), a Director of the Gandhi Research Foundation in Jalgaon, Maharashtra.\nLeela Gandhi (1966–),  daughter of Ramchandra Gandhi, John Hawkes Professor of Humanities and English, author and director of the Pembroke Center for Teaching and Research on Women at Brown University.\nSonali Kulkarni, daughter of Sumitra and Gajanan Raghunath Kulkarni, CEO of Fanuc India and married Ravi Venkatesan, a business executive.\nShrikrishna Kulkarni, son of Sumitra and Gajanan Raghunath Kulkarni, COO of Panasonic India and director of Cybernetic Research Labs,  chairperson of IIM Culcutta, trustee of Gujarat Vidyapith\nShriram Kulkarni, son of Sumitra and Gajanan Raghunath Kulkarni\n\n\n== Family tree (partial, generations 2 through 6) ==\n\n\n== External links ==\nPhoto essay on 'Four Generations Of Mahatma Gandhi Family Photos | Rare & Old Vintage Photos | Real-Life Photos\" illustrating the Gandhi family members. Although titled '4 generations', actually 6 generations are shown, as noted via ArunGandhi.net.\n\n\n== References ==\n\n...",
    "url": "https://en.wikipedia.org/wiki/Family_of_Mahatma_Gandhi",
    "related_articles": [
      "Assassination of Mahatma Gandhi",
      "Mahatma Gandhi",
      "Manilal Gandhi",
      "Gandhi Jayanti"
    ]
  },
  "timestamp": 1754303272.006494
}