{
  "subject": "science",
  "topic": "reproduction",
  "wikipedia": {
    "title": "Reproduction and pregnancy in speculative fiction",
    "summary": "Speculative and science fiction writers have often addressed the social, political, technological, and biological consequences of pregnancy and reproduction through the exploration of possible futures or alternative realities.\n\n",
    "content": "Speculative and science fiction writers have often addressed the social, political, technological, and biological consequences of pregnancy and reproduction through the exploration of possible futures or alternative realities.\n\n\n== Themes ==\n\nAs real-world reproductive technology has advanced, SF works have become increasingly interested in representing alternative modes of reproduction. Among the uses of pregnancy and reproduction themes regularly encountered in science fiction are:\n\nother modes of sexual reproduction;\nparthenogenetic reproduction;\nthe use of technology in reproduction;\nThe phenomenon of pregnancy itself has been the subject of numerous works, both directly and metaphorically. These works may relate pregnancy to parasitism or slavery, or simply use pregnancy as a strong contrast with horror. For example, in the film, Rosemary's Baby (1968) (based on the 1967 novel by Ira Levin) a woman is tricked into a satanic pregnancy by her husband.\n\n\n=== Alien–human hybrids ===\nInter-species reproduction and alien-human hybrids frequently occur in science fiction, and women being impregnated by aliens is a common theme in SF horror films, including I Married a Monster from Outer Space, Village of the Damned, Inseminoid, and Xtro. The theme has even been parodied, such as in the soft porn Wham Bam Thank You Spaceman. \nIn the film Alien Resurrection (1997), Ellen Ripley has been cloned to facilitate study of the alien queen embryo with which she was implanted In Octavia E. Butler's Lilith's Brood trilogy (1987, 1988, 1989) alien and human females impregnated with the DNA of males by alien intermediary-sex individuals, in \"fivesomes\".\n\n\n== Reproduction and technology ==\n\nSpeculative fiction in technology of reproduction may involve cloning and ectogenesis, i.e., artificial reproduction).\nThe latter part of the 2000s decade has also seen an upswing of films and other fiction depicting emotional struggles of assisted reproductive technology in contemporary reality rather than being speculation.\n\n\n== Large-scale infertility or population growth ==\nFertility and reproduction have been frequent sites for examination of concerns about the impact of the environment and reproduction on the future of humanity or civilization. For example, The Children of Men by P. D. James is just one of many works which have considered the implications of global infertility; Make Room! Make Room! by Harry Harrison is one of many works which have examined the converse, the implications of massive human population surges. Numerous other works, such as Implosion, The First Century after Beatrice, Venus Plus X and More Than Human by Theodore Sturgeon examine the future of humanity as it evolves, or particular breeding programs.\n\n\n== Politics and gender politics ==\nPregnancy and control of human reproduction have often been used as proxies for treating gender issues or broader themes of social control; works dealing with pregnancy and human reproduction have also been used to closely explore gender politics. For instance, \"male pregnancy\" has been used to comedic effect in mainstream literature and films such as Junior (1994 film, dir. Ivan Reitman), and has developed a following in fan fiction—the mpreg genre.\nThe genre of feminist science fiction has explored single-sex reproduction in depth, particularly parthenogenesis, as well as gendered control over the ability and right to reproduce. See also numerous dystopian stories about state-controlled reproduction, abortion, and birth control, such as Atwood's The Handmaid's Tale, or her short story, Freeforall. These works have often been analyzed as explorations of contemporary political debates about reproduction and pregnancy.\n\n\n== See also ==\nCyborg feminism\nGender in speculative fiction\nLGBTQ themes in speculative fiction\nInterspecies reproduction\nParthenogenic reproduction\nSex and sexuality in speculative fiction\n\n\n== References ==\n\n\n== Further reading ==\nAllman, John (Spring 1990). \"Motherless Creation: Motifs in Science Fiction\". North Dakota Quarterly. 58 (2). University of North Dakota: 124–132.\nBarr, Marleen (1988). \"Blurred Generic Conventions: Pregnancy and Power in Feminist Science Fiction\". Reproductive and Genetic Engineering. 1 (2). Pergamon Press: 167–174. OCLC 16678507.\nBattis, Jes (March 30, 2007), \"Moya: births, biomechanoids, and companion species\", in Battis, Jes (ed.), Investigating Farscape: Uncharted Territories of Sex and Science Fiction, Investigating cult TV series, London: I.B. Tauris, pp. 41–64, ISBN 9780857713650.\nBroege, Valerie (Fall 1988). \"Views on Human Reproduction and Technology in Science Fiction\". Extrapolation. 29 (3). Liverpool University Press: 197–215. doi:10.3828/extr.1988.29.3.197.\nClover, Carol (1992). Men, Women, and Chainsaws: Gender in the Modern Horror Film. London: British Film Institute. ISBN 9780851703312.\nDonawerth, Jane (2006), \"Illicit Reproduction: Clare Winger Harris's The Fate of the Poseidonia\", in Larbalestier, Justine (ed.), Daughters of earth: feminist science fiction in the twentieth century, Middletown, Connecticut: Wesleyan University Press, pp. 20–35, ISBN 9780819566768.\nDuncan, Carol (2005), \"Black Women and Motherhood in Contemporary Cinematic Science Fiction\", in O'Reilly, Andrea (ed.), Mother Matters: Motherhood as Discourse and Practice, Toronto, Canada: Association for Research on Mothering, pp. 79–86, ISBN 9781550144369.\nFerreira, Maria Aline Seabra (2005). I Am the Other: Literary Negotiations of Human Cloning. Westport, Connecticut: Praeger. ISBN 9780313320064. Google preview. Including discussion of male pregnancy, sexual politics, and parthenogenesis.\nGrace, Dominick (Spring 2005). \"Frankenstein, Motherhood, and Phyllis Gotlieb's O Master Caliban!\". Extrapolation. 46 (1). Liverpool University Press: 90–102. doi:10.3828/extr.2005.46.1.9.\nSophia, Zoë (Summer 1984). \"Exterminating Fetuses: Abortion, Disarmament, and the Sexo-semiotics of Extraterrestrialism\". Diacritics. 14 (2). Johns Hopkins University Press: 47–59. doi:10.2307/464758. JSTOR 464758.",
    "url": "https://en.wikipedia.org/wiki/Reproduction_and_pregnancy_in_speculative_fiction",
    "related_articles": [
      "Sexual reproduction",
      "Reproduction",
      "Animal Reproduction Science",
      "Asexual reproduction"
    ]
  },
  "timestamp": 1754465839.35414
}