{
  "subject": "history",
  "topic": "akhbar the king",
  "wikipedia": {
    "title": "King Khalid University",
    "summary": "King Khalid University is a public university in Abha, Saudi Arabia. Established in 1998, the university came to being through the merger of the satellite campuses of Imam Mohammad Ibn Saud Islamic University and King Saud University into one entity. It is named after King Khalid bin Abdulalziz, the ruler of Saudi Arabia from 1975 until 1982.",
    "content": "King Khalid University is a public university in Abha, Saudi Arabia. Established in 1998, the university came to being through the merger of the satellite campuses of Imam Mohammad Ibn Saud Islamic University and King Saud University into one entity. It is named after King Khalid bin Abdulalziz, the ruler of Saudi Arabia from 1975 until 1982.\n\n\n== History ==\nKing Khalid University was established in 1998 under Abdullah bin Abdulaziz Al Saud's order to merge Imam Mohammad Ibn Saud Islamic University and King Saud University in the southern region. The university operates under the Ministry of Education. The university is located in Asir, Saudi Arabia.\nThe university commenced operations with four colleges:\n\nCollege of Sharia and Fundamentals of Religion;\nCollege of Arabic Language;\nCollege of Social and Administrative Sciences;\nCollege of Education.\nAs of 2019, there are 29 colleges encompassing many disciplines such as engineering, computer science, and medicine. As of 2019, King Khalid University serves approximately 60,000 students.\nKing Khalid University was recently ranked fourth in overall performance among universities in Saudi Arabia. In a 2024 ranking by QS World University Rankings, King Khalid University was internationally ranked 761. As part of the strategic plan, the university objective is to increase its ranking to the top 200 by 2030.\n\n\n=== 2012 student protests and change of university presidency ===\n\nOn 7 March 2012, during the 2011–2012 Saudi Arabian protests, women students of the university protested against \"injustice and inequality\" and \"discrimination and mistreatment\" by university security staff. The students were attacked by security forces and on 10 March held a sit-in calling for the rector Abdullah al-Rashid to resign. On 1 July 2012, Rashid was fired by King Abdullah and replaced by Abdulrahman al-Dawood.\n\n\n== Organisational structure ==\n\n\n=== Leadership ===\n\n\n==== Presidency ====\nAbdullah al-Rashid was the elected or appointed president of King Khalid University until 1 July 2012, during the 2011–12 Saudi Arabian protests, when he was replaced by Abdulrahman al-Dawood following massive student protests in May and calls for his resignation. As of 2019, Faleh al-Solami was the president of the university.\n\n\n=== Colleges and departments ===\nSharia and Fundamentals of Religion College\nComputer Science College\nEducation College\nHumanities College\nEngineering College\nCollege of Business\nScience College\nLanguages and Translation College\nMedicine College\nDentistry college\nPharmacy College\nApplied Medical Sciences College\n\n\n=== Research centers ===\nKing Khalid Chair for Scientific Research\nAl Jazirah Newspaper Chair\nMedia Center\nAdministrative Leaders Preparation Center\nCenter of Research and Social Studies\nPrince Sultan bin Abdul Alziz Center for Research and Environmental Studies and Tourism\nCenter for Talent and Creativity\nCenter of Linguistic Research\nCenter of Governing Companies\nKnowledge Entrepreneurship Center\nTahawol Center\nCenter for Documentation Archiving\nResearch Science Center for Advanced Materials\n\n\n=== Associations ===\nSaudi Association for Statistical Sciences\nSaudi Society for Medical Education\n\n\n== Location ==\nSince its inception, the goal was to have King Khalid University operate at a single central location. This was impractical at the outset due to the size of the project and the massive infrastructure requirements. Initially, the university occupied buildings in many different locations. In 2011–12, the university completed construction of the Guraiger Campus in Abha. This has served and continues to serve as the main campus for all educational and administration. A female campus was built in al-Samar in Abha. There are still a few satellite campuses that can operate with a great deal of independence. However, the goal of a single fully integrated facility remains and is in progress.\nAs of 2019, a standalone campus for King Khalid University was under construction in al-Fara and the female campus is shifted to Guraiger campus in Abha. This new campus is commonly known as University City. As part of the medical college, plans were made to build a public hospital which would have one of the largest bed capacities in the Middle East. Because of the scope of the construction project, there were many international bidders for the contract. The university, in cooperation with the King Abdullah Institute for Research and Studies and King Saud University, organized a global competitive bidding program for the design, planning, and construction of University City. As one of the most prominent higher education infrastructure projects in the Kingdom, the competition attracted 28 regional, national, and international bidders. To qualify for the bidding process, each company had to prove its capabilities in large scale construction. The infrastructure at University City is substantial. There are two major service buildings that provide electromechanical components and utilities to all the other buildings on the campus. The two service buildings are connected by a service tunnel that is 17 km (11 mi) in length.\n\n\n== See also ==\n\nList of universities and colleges in Saudi Arabia\n\n\n== References ==",
    "url": "https://en.wikipedia.org/wiki/King_Khalid_University",
    "related_articles": [
      "Tariq ibn Ziyad",
      "Abdullah of Saudi Arabia",
      "Salman of Saudi Arabia",
      "History of Spain"
    ]
  },
  "timestamp": 1756116377.6481347
}